## load often use libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

## pandas.read_csv(exsample : titanic)
Read a comma-separated values (csv) file into DataFrame.

In [2]:
PATH = "./titanic_input/"

In [3]:
train = pd.read_csv(PATH+"train.csv")
test = pd.read_csv(PATH+"test.csv")
gender_submission = pd.read_csv(PATH+"gender_submission.csv")

## pandas.DataFrame.to_csv
Write object to a comma-separated values (csv) file.  
Parameters :  
``sep`` : str, default ``,``  
String of length 1. Field delimiter for the output file.  
``index`` : bool, default ``True``  
Write row names (index).

In [11]:
gender_submission.to_csv("submission.csv",index=False)

## pandas.DataFrame
Two-dimensional, size-mutable, potentially heterogeneous tabular data.  

Data structure also contains labeled axes (rows and columns). Arithmetic operations align on both row and column labels. Can be thought of as a dict-like container for Series objects. The primary pandas data structure.

In [9]:
df = pd.DataFrame({"A": [1, 2], "B": [3.4, -4.9],"C":["abc","def"]})
df

   A    B    C
0  1  3.4  abc
1  2 -4.9  def

In [10]:
df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                   columns=['a', 'b', 'c'])
df2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

## pandas.DataFrame.shape
``df.shape`` returns a tuple representing the dimensionality of the DataFrame``(index(列),column(行))``.

In [20]:
print(train.shape)
print(test.shape)
print(gender_submission.shape)

(891, 12)
(418, 11)
(418, 2)

## pandas.DataFrame.head() tail()
``df.head(n)`` returns first n rows.(default 5)  
``df.tail(n)`` returns last n rows.(default 5)

In [16]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

## pandas.DataFrame.columns
The column labels of the DataFrame

In [21]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

## pandas.DataFrame.dtypes
Return the dtypes in the DataFrame.

In [34]:
print(train.dtypes)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [35]:
print(train["Fare"].dtype)

float64

## pandas.DataFrame.info()
Print a concise summary of a DataFrame.

In [30]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## pandas.DataFrame.value_counts()
Return a Series containing counts of unique rows in the DataFrame.  
Parameters:
- ``sort`` : bool,default ``True``
- ``ascending`` bool,default ``False``
- ``normalizebool``, default ``False``

In [40]:
train["Embarked"].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [41]:
train["Embarked"].value_counts(sort=False)

Q     77
C    168
S    644
Name: Embarked, dtype: int64

In [42]:
train["Embarked"].value_counts(ascending=True)

Q     77
C    168
S    644
Name: Embarked, dtype: int64

In [43]:
train["Embarked"].value_counts(normalize=True)

S    0.724409
C    0.188976
Q    0.086614
Name: Embarked, dtype: float64

## pandas.DataFrame.isnull()
Detect missing values. (detect : 見破る)

In [44]:
train.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [46]:
train.isnull().sum() # use frequently

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [16]:
tmp = train["Age"].isnull().sum()
print("this colmun has  "+str(tmp)+"  missing values")

this colmun has  177  missing values

In [7]:
total_cells = np.product(train.shape) # 全セル数
total_missing = train.isnull().sum().sum()
percent_missing = (total_missing/total_cells)*100 # 欠損値の占める割合(%)
print("missing value : "+str(percent_missing)+" %")

missing value :8.099513655069211 %

## pandas.DataFrame.notnull
Detect existing (non-missing) values.

In [6]:
train.notnull().head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,True,True,True,True,True,True,True,True,True,True,False,True
1,True,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,False,True
3,True,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,True,False,True

## pandas.DataFrame.fillna
Parameters :  
``method`` :論理的な順序を持っているデータの場合欠落している値を直後の値で埋める方が理にかなっている.この場合'bfill'にする.

In [8]:
train["Age"].fillna(train["Age"].median)

0                                                     22
1                                                     38
2                                                     26
3                                                     35
4                                                     35
                             ...
886                                                   27
887                                                   19
888    <bound method Series.median of 0      22.0\n1 ...
889                                                   26
890                                                   32
Name: Age, Length: 891, dtype: object

## pandas.DataFrame.describe
Generate descriptive statistics.  
  
Descriptive statistics include those that summarize the central tendency, dispersion and shape of a dataset’s distribution, excluding NaN values.  

和訳 :   
記述統計量(descriptive statistics)を生成する.  
  
記述統計には,NaN値を除いたデータセットの分布の中心傾向,分散,形状を要約する統計量が含まれます.

In [47]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### get Individual descriptive statistics

In [51]:
print(train.mean())

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [52]:
print(train.std())

PassengerId    257.353842
Survived         0.486592
Pclass           0.836071
Age             14.526497
SibSp            1.102743
Parch            0.806057
Fare            49.693429
dtype: float64

In [53]:
print(train["Age"].mean()) # get

29.69911764705882

##  pandas.concat
``ignore_index`` : bool default ``False``   
(If True, do not use the index values along the concatenation axis)
(Trueのとき,連結軸に沿ったindex値を使用しない)

In [6]:
dataset = pd.concat((train,test),ignore_index=True)
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## pandas.DataFrame.rename

In [9]:
# rename columns
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
df.rename(columns={"A": "AAA", "B": "BBB"})

   AAA  BBB
0    1    4
1    2    5
2    3    6

In [8]:
# rename index
df.rename(index={0: "x", 1: "y", 2: "z"})

   A  B
x  1  4
y  2  5
z  3  6

## pandas.DataFrame.drop
Drop specified labels from rows or columns.  
  
Remove rows or columns by specifying label names and corresponding axis, or by specifying directly index or column names. When using a multi-index, labels on different levels can be removed by specifying the level.  
Parameters :  
- ``labels`` : ``single label`` or ``list-like`` Index or column labels to drop.  
- ``axis`` : {0 or ‘index’, 1 or ‘columns’}, default ``0``
Whether to drop labels from the index (0 or ‘index’) or columns (1 or ‘columns’). 
  
(インデックス（0または'index'）からラベルをドロップするか,カラム（1または'columns'）からドロップするか.)  
- ``inplace`` : bool, default ``False``  
If False, return a copy. Otherwise, do operation inplace and return None.
  
(Falseのときコピーを返します.それ以外の場合inplace(代入)を行い返り値がありません.)

In [5]:
drop_features = ["Ticket","PassengerId"]
train.drop(labels = drop_features, axis = 1, inplace = False).head() # inplace=Trueだと上書き

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,NaN,S

## pandas.DataFrame.to_numpy
Convert the DataFrame to a NumPy array.

In [4]:
# prepare
df = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                   columns=['a', 'b', 'c'])
a = df.to_numpy()
a

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

## pandas.DataFrame.reindex

Conform Series/DataFrame to new index with optional filling logic.

In [8]:
# prepare
df = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                   columns=['a', 'b', 'c'])

df.reindex(columns=['c', 'b', 'a']) # indexも同様

   c  b  a
0  3  2  1
1  6  5  4
2  9  8  7